# GROUP DISCUSSION

In [3]:
##import lib, set pandas display

#import pandas
import pandas as pd

# set display format float
pd.options.display.float_format = "{:,.2f}".format

## Latihan List Comprehension

**Latihan :**

1. Menggunakan list comprehension dan fungsi range() buat list yang berisi angka 1 hingga 100
    <br/><br/>
    
2. Ubah pernyataan dibawah ini menjadi list comprehension
```python
list_a = [3,9,27,81,243]
list_b = []
for value in list_a:
    list_b.append(value/3)
list_b
```

3. Ubah pernyataan dibawah ini menjadi list comprehension
```python
list_1 = [x for x in range(100)]
list_2 = []
for value in list_1:
    if value < 25:
        list_2.append(value * 2)
list_2
```

## Jawaban list comprehension

In [4]:
#Jawaban soal 1
list_saya=[]
for i in range(1,100,1):
    list_saya.append(i)
print(list_saya)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

In [5]:
range_2 = range(1,100,1)
list1 = list(range_2)
print(list1)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

In [6]:
#Jawaban Soal 2
list_a = [3,9,27,81,243]
list_b = []
for value in list_a:
    list_b.append(value/3)
list_b

[1.0, 3.0, 9.0, 27.0, 81.0]

In [7]:
#Jawaban Soal 3
list_1 = [x for x in range(100)]
list_2 = []
for value in list_1:
    if value < 25:
        list_2.append(value * 2)
print(list_2)

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48]

## Latihan .loc dan .iloc

> **Dengan menggunakan data weather**

In [8]:
# data weather
df_lat = pd.read_csv("https://raw.githubusercontent.com/CRMDSDIP/PJJDAS_IV/main/Data_Preparation/day1/dataset/raw/data_weather.csv")
# df_lat = pd.read_csv("dataset/raw/data_weather.csv")
df_lat = df_lat.set_index('Day')
df_lat

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

**Latihan :**

1. Latihan 1
    - dengan .loc dan .iloc (keduanya)
    - ambil row ke 2 sampai dengan row ke 5 (bukan index)
    - dari kolom Weather, Wind, Humidity <br/><br/>
    
2. Latihan 2
    - Tampilkan Dataframe
    - dengan .loc ambil weather hari Jumat
    - dengan .iloc ambil semua data dari Selasa sampai dengan Kamis

## Jawaban .loc dan .iloc

In [9]:
#jawaban 1
# ambil row ke 2 sampai dengan row ke 5 (bukan index) dari kolom Weather, Wind, Humidity

# menggunakan loc
df_lat.loc['Tue':'Sat',['Weather','Wind','Humidity']] # dengan loc

    Weather  Wind  Humidity
Day
Tue   Sunny    28        96
Wed   Sunny    16        20
Thu  Cloudy    11        22
Fri  Shower    26        79
Sat  Shower    27        62

In [10]:
# menggunakan iloc
df_lat.iloc[1:6,[0,2,3]] # dengan iloc

    Weather  Wind  Humidity
Day
Tue   Sunny    28        96
Wed   Sunny    16        20
Thu  Cloudy    11        22
Fri  Shower    26        79
Sat  Shower    27        62

In [11]:
#jawaban 2

# Tampilkan Dataframe
df_lat

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [24]:
# mengambil weather hari Jumat menggunakan loc
df_friday = df_lat.loc['Fri':'Fri',['Weather']]
df_friday

    Weather
Day
Fri  Shower

In [22]:
# mengambil semua data dengan .iloc dari Selasa sampai dengan Kamis
df2 = df_lat.iloc[1:4,]
df2

    Weather  Temperature  Wind  Humidity
Day
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22

## Latihan Filtering Data

> **Dengan menggunakan data weather**

In [83]:
# data weather
df_lat = pd.read_csv("https://raw.githubusercontent.com/CRMDSDIP/PJJDAS_IV/main/Data_Preparation/day1/dataset/raw/data_weather.csv")
# df_lat = pd.read_csv("dataset/raw/data_weather.csv")
df_lat = df_lat.set_index('Day')
df_lat

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

**Latihan :**

1. Latihan 1
   - dengan menggunakan conditional (cara apa saja), tampilkan baris dengan weather sunny <br/><br/>

2. Latihan 2
   - dengan menggunakan conditional (cara apa saja), tampilkan baris dengan weather sunny dan wind <= 20

## Jawaban Filtering Data

In [148]:
# jawaban 1
# dengan menggunakan conditional (cara apa saja), tampilkan baris dengan weather sunny
df_lat[df_lat['Weather'] == 'Sunny']

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Sun   Sunny        17.50    20        10

In [149]:
# jawaban 2
# dengan menggunakan conditional (cara apa saja), tampilkan baris dengan weather sunny dan wind <= 20
df_lat[(df_lat['Weather'] == 'Sunny') & (df_lat['Wind'] <= 20)]

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Wed   Sunny        17.51    16        20
Sun   Sunny        17.50    20        10

## Latihan Lambda

> **Dengan menggunakan data nilai**

In [150]:
## data nilai

# initializing a list
values= [['Reza',90,90],['Rizky',100,90],['Pratama',100,80],
         ['Ade',95,85],['Satya',100,95],['Wahana',90,85]]

# creating pandas dataframe
df_lambda = pd.DataFrame(values, columns=['Name','Nilai_Mtk','Nilai_Fisika'])
df_lambda

      Name  Nilai_Mtk  Nilai_Fisika
0     Reza         90            90
1    Rizky        100            90
2  Pratama        100            80
3      Ade         95            85
4    Satya        100            95
5   Wahana         90            85

Latihan lambda :
- menggunakan .apply()
- karena semua murid mencontek (kecuali ade) maka "Nilai_Mtk" selain ade dikurangi 10
- karena jujur murid bernama "Ade" maka "Nilai_Mtk" ditambah 5

## Jawaban Lambda

In [151]:
#jawaban lambda :

df_lambda['Nilai_Mtk'] = df_lambda.apply(lambda x : x['Nilai_Mtk'] + 5 if x['Name']=='Ade' else x['Nilai_Mtk']-10, axis=1)
df_lambda
# ini menunjukkan salah satu fungsi dari df.copy() => df asal tetap

      Name  Nilai_Mtk  Nilai_Fisika
0     Reza         80            90
1    Rizky         90            90
2  Pratama         90            80
3      Ade        100            85
4    Satya         90            95
5   Wahana         80            85

## Latihan Akhir

> **Dengan menggunakan data sales**

In [152]:
# Data Sales
df = pd.read_csv('https://raw.githubusercontent.com/CRMDSDIP/PJJDAS_IV/main/Data_Preparation/day1/dataset/raw/sales_data_latihan.csv')
# df = pd.read_csv("dataset/raw/sales_data_latihan.csv")
df

,Customer Number,Customer Name,Address,Type,Sales,Percent Growth
0,100025,Quest Industry,"Kebayoran Lama, Jakarta",Company,Rp162500000,30.00%
1,552278,Smith Plumbing,"Pasteur, Bandung",Company,Rp101200000,10.00%
2,234775,ACME Industrial,"Kebayoran Lama, Jakarta",Perusahaan,62500000,NaN
3,249000,Brekke LTD,"Pasteur, Bandung",Company,4900000,4.00%
4,651029,Harbor Co,"Cilincing, Jakarta",Company,Rp12750000,-15.00%
5,565600,Berkah Jaya,"Antapani, Bandung",Perusahaan,Rp762500000,30.00%
6,897440,Rafee Ahmad,"Sawangan, Depok",Personal,"Rp12,200,000.00",10.00%
7,123156,Reza Pratama,"Kebayoran Baru, Jakarta",Personal,50000000,25
8,138135,PT Berdikari,"Kebayoran Lama, Jakarta",Perusahaan,Rp9000000,4.00%
9,748952,Alexander Samiun,"Sleman, Jogjakarta",Individu,127450000,-15.00%

Latihan Akhir : 
1. Perbaiki format data:
- Kolom sales seharusnya numerik (hapus Rp)
- Kolom "Percent Growth" seharusnya numerik (tanpa tanda %) dan isi NaN (Null) dengan nilai Rata-rata (Mean)
- Hilangkan spasi berlebih pada kolom Type 
<br/><br/>
2. Buat laporan:
- Jumlah Sales Berdasarkan Tipe
- Ambil 3 "Customer Name" dengan kenaikan tertinggi

## Jawaban Akhir :

In [88]:
## Jawaban 1 :

In [89]:
# Sales

In [90]:
# Percent Growth

In [91]:
# Type

In [92]:
## Jawaban 2 :

In [93]:
# sales berdasarkan Type

In [94]:
# top 3 Customer Percent Growth